---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudOverrides.IsEqual(Autodesk.Revit.DB.PointClouds.PointCloudOverrides)
source: html/722f87b7-f5c8-7f43-6b2d-fc7be4b0795a.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrides.IsEqual Method

Check if the contents of two overrides are equal.

## Syntax (C#)
```csharp
public bool IsEqual(
	PointCloudOverrides other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.PointClouds.PointCloudOverrides`) - The overrides to be compared.

## Returns
True for equal, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null